--liquibase formatted sql
--changeset Kharlamov.Vladislav:1
CREATE TABLE IF NOT EXISTS "students" (
    "id"            IDENTITY PRIMARY KEY,
    "name"          VARCHAR(64) NOT NULL,
    "surname"       VARCHAR(64) NOT NULL,
    "patronymic"    VARCHAR(64),
    "birth_date"    DATE NOT NULL,
    "group"         VARCHAR(8) NOT NULL
);

INSERT INTO "students"
    ("name", "surname", "patronymic", "birth_date", "group")
VALUES
    ('Ivan',            'Ivanov',       'Ivanovich',        '2000-01-01', 'P3101'),
    ('Петров',          'Пётр',         'Петрович',         '2005-06-06', 'P3102'),
    ('Doe',             'John',         null,               '1980-12-31', 'P3113'),
    ('Бурова',          'Елизавета',    'Владимировна',     '1974-04-20', 'R1001'),
    ('Чернов',          'Елисей',       'Александрович',    '1957-07-01', 'X1001'),
    ('Иванов',          'Виктор',       'Андреевич',        '2012-05-19', 'B1001'),
    ('Захаров',         'Кирилл',       'Егорович',         '2001-08-06', 'M1001'),
    ('Шмелева',         'Таисия',       'Викторовна',       '1950-01-05', 'K2001'),
    ('Белоусова',       'Алиса',        'Ярославовна',      '1993-05-28', 'L2001'),
    ('Захаров',         'Константин',   'Васильевич',       '1981-05-12', 'R2001'),
    ('Муравьев',        'Роман',        'Александрович',    '2002-06-09', 'R2001'),
    ('Антонов',         'Лука',         'Германович',       '1962-08-04', 'L3001'),
    ('Андреева',        'Валерия',      'Артёмовна',        '1964-11-15', 'B3001'),
    ('Александрова',    'Кристина',     'Никитична',        '1987-03-10', 'X3001'),
    ('Новиков',         'Тимофей',      'Тимофеевич',       '1952-02-23', 'H3001'),
    ('Степанова',       'Ника',         'Ильинична',        '1950-06-27', 'Z5001'),
    ('Баранова',        'Светлана',     'Александровна',    '2002-07-29', 'O5001'),
    ('Матвеев',         'Алексей',      'Артурович',        '2003-01-29', 'V5001');
--rollback DROP TABLE IF EXISTS students;